# DataFrame

In [4]:
import numpy as np
import pandas as pd

In [8]:
rows = ['sale', 'sale2', 'sale3']
columns = ['zoneA', 'zoneB', 'zoneC']
data = [[123, 142, 245], [244, 533, 644], [267, 321, 865]]

In [10]:
dataFrame = pd.DataFrame(data, rows, columns)
dataFrame

       zoneA  zoneB  zoneC
sale     123    142    245
sale2    244    533    644
sale3    267    321    865

In [13]:
dataFrame.loc[['sale', 'sale2']]

       zoneA  zoneB  zoneC
sale     123    142    245
sale2    244    533    644

In [18]:
dataFrame[['zoneA', 'zoneC']]

       zoneA  zoneC
sale     123    245
sale2    244    644
sale3    267    865

In [19]:
dataFrame.loc['sale']['zoneA']

123

In [21]:
dataFrame['TotalSale'] = dataFrame['zoneA'] + dataFrame['zoneB'] + dataFrame['zoneC']
dataFrame

       zoneA  zoneB  zoneC  TotalSale
sale     123    142    245        510
sale2    244    533    644       1421
sale3    267    321    865       1453

In [22]:
dataFrame

       zoneA  zoneB  zoneC  TotalSale
sale     123    142    245        510
sale2    244    533    644       1421
sale3    267    321    865       1453

In [27]:
#dataFrame.drop('TotalSale', axis = 1, inplace= True)
dataFrame

       zoneA  zoneB  zoneC
sale     123    142    245
sale2    244    533    644
sale3    267    321    865